In [67]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder,StandardScaler
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score, classification_report, confusion_matrix

In [68]:
data = pd.read_csv("Titanic-Dataset.csv")

In [69]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [70]:
data=data.drop(["PassengerId", "Name", "Ticket", "Cabin", "Embarked"], axis=1)

In [71]:
data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [72]:
le=LabelEncoder()

In [73]:
data["Sex"]=le.fit_transform(data["Sex"])

In [74]:
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

In [75]:
data.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
dtype: int64

In [76]:
data.shape

(891, 7)

In [77]:
data=data.dropna()

In [78]:
data.shape

(714, 7)

In [79]:
data.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
dtype: int64

In [80]:
y=data["Survived"]

In [81]:
x=data.drop("Survived",axis=1)

In [82]:
x.head()

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    1  22.0      1      0   7.2500
1       1    0  38.0      1      0  71.2833
2       3    0  26.0      0      0   7.9250
3       1    0  35.0      1      0  53.1000
4       3    1  35.0      0      0   8.0500

In [83]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [84]:
ss=StandardScaler()

In [85]:
x=ss.fit_transform(x)

In [86]:
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=42)

In [87]:
x_train.shape, x_test.shape, y_train.shape, y_test.shape

((571, 6), (143, 6), (571,), (143,))

In [88]:
svc=SVC()

In [89]:
model=svc.fit(x_train,y_train)

In [90]:
y_predicted=svc.predict(x_test)

In [91]:
accuracy=accuracy_score(y_test,y_predicted)

In [92]:
accuracy

0.8041958041958042

In [93]:
classification_report(y_test, y_predicted)

'              precision    recall  f1-score   support\n\n           0       0.82      0.87      0.84        87\n           1       0.78      0.70      0.74        56\n\n    accuracy                           0.80       143\n   macro avg       0.80      0.78      0.79       143\nweighted avg       0.80      0.80      0.80       143\n'

In [94]:
confusion_matrix(y_test, y_predicted)

array([[76, 11],
       [17, 39]], dtype=int64)

In [95]:
data.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

In [161]:
def predictor(pclass,gender,age,sibsp,parch,fare):
    gender=gender.lower()
    gender=list(gender.split(" "))
    gender=le.transform(gender)[0]
    li=ss.transform([[pclass,gender,age,sibsp,parch,fare]])
    predicted=model.predict(li)
    return predicted[0]

In [163]:
predictor(1,"Male",22,1,0,7.2500)

0